import json
from typing import Dict, List, Tuple

from nonebot import get_driver

resPath = get_driver().config.gspanel_res
if not resPath:
    raise ValueError("请在环境变量中添加 gspanel_res 参数")
nameTrans: Dict = {}
weaponTrans: Dict = {}
artiTrans: Dict = {}
propTrans: Dict = {}
posTrans: Dict = {}
eTypeTrans: Dict = {}
attrValue: Dict = {}
allMainAffix: Dict = {}
allSubAffix: List = []
multiRule: Dict = {}


def getElement(char: str) -> str:
    charMap = {
        "安柏": "火",
        "凯亚": "冰",
        "丽莎": "雷",
        "芭芭拉": "水",
        "雷泽": "雷",
        "香菱": "火",
        "北斗": "雷",
        "行秋": "水",
        "凝光": "岩",
        "菲谢尔": "雷",
        "班尼特": "火",
        "诺艾尔": "岩",
        "重云": "冰",
        "砂糖": "风",
        "琴": "风",
        "迪卢克": "火",
        "七七": "冰",
        "莫娜": "水",
        "刻晴": "雷",
        "温迪": "风",
        "可莉": "火",
        "迪奥娜": "冰",
        "达达利亚": "水",
        "辛焱": "火",
        "钟离": "岩",
        "阿贝多": "岩",
        "甘雨": "冰",
        "魈": "风",
        "胡桃": "火",
        "罗莎莉亚": "冰",
        "烟绯": "火",
        "优菈": "冰",
        "枫原万叶": "风",
        "神里绫华": "冰",
        "早柚": "风",
        "宵宫": "火",
        "埃洛伊": "冰",
        "九条裟罗": "雷",
        "雷电将军": "雷",
        "珊瑚宫心海": "水",
        "托马": "火",
        "五郎": "岩",
        "荒泷一斗": "岩",
        "云堇": "岩",
        "申鹤": "冰",
        "八重神子": "雷",
        "神里绫人": "水",
        "夜兰": "水",
        "久岐忍": "雷"
    }
    return charMap[char] if char in charMap else "水"


def getCharRule(char: str) -> Dict:
    with open(f"{resPath}calc-rule.json", encoding="UTF-8") as f:
        allCalcRule = json.load(f)
        assert isinstance(allCalcRule, dict)
    return allCalcRule[char]


def getNameTrans() -> Tuple[Dict, Dict]:
    global nameTrans
    global weaponTrans
    nameTrans = {
        "01": "凯特",
        "02": "神里绫华",
        "03": "琴",
        "05": "旅行者",
        "06": "丽莎",
        "07": "旅行者",
        "14": "芭芭拉",
        "15": "凯亚",
        "16": "迪卢克",
        "20": "雷泽",
        "21": "安柏",
        "22": "温迪",
        "23": "香菱",
        "24": "北斗",
        "25": "行秋",
        "26": "魈",
        "27": "凝光",
        "29": "可莉",
        "30": "钟离",
        "31": "菲谢尔",
        "32": "班尼特",
        "33": "达达利亚",
        "34": "诺艾尔",
        "35": "七七",
        "36": "重云",
        "37": "甘雨",
        "38": "阿贝多",
        "39": "迪奥娜",
        "41": "莫娜",
        "42": "刻晴",
        "43": "砂糖",
        "44": "辛焱",
        "45": "罗莎莉亚",
        "46": "胡桃",
        "47": "枫原万叶",
        "48": "烟绯",
        "49": "宵宫",
        "50": "托马",
        "51": "优菈",
        "52": "雷电将军",
        "53": "早柚",
        "54": "珊瑚宫心海",
        "55": "五郎",
        "56": "九条裟罗",
        "57": "荒泷一斗",
        "58": "八重神子",
        "60": "夜兰",
        "62": "埃洛伊",
        "63": "申鹤",
        "64": "云堇",
        "65": "久岐忍",
        "66": "神里绫人",
    }
    weaponTrans = {
        "11101": "无锋剑",
        "11201": "银剑",
        "11301": "冷刃",
        "11302": "黎明神剑",
        "11303": "旅行剑",
        "11304": "暗铁剑",
        "11305": "吃虎鱼刀",
        "11306": "飞天御剑",
        "11401": "西风剑",
        "11402": "笛剑",
        "11403": "祭礼剑",
        "11404": "宗室长剑",
        "11405": "匣里龙吟",
        "11406": "试作斩岩",
        "11407": "铁蜂刺",
        "11408": "黑岩长剑",
        "11409": "黑剑",
        "11410": "暗巷闪光",
        "11412": "降临之剑",
        "11413": "腐殖之剑",
        "11414": "天目影打刀",
        "11415": "辰砂之纺锤",
        "11501": "风鹰剑",
        "11502": "天空之刃",
        "11503": "苍古自由之誓",
        "11504": "斫峰之刃",
        "11505": "磐岩结绿",
        "11509": "雾切之回光",
        "11510": "波乱月白经津",
        "12101": "训练大剑",
        "12201": "佣兵重剑",
        "12301": "铁影阔剑",
        "12302": "沐浴龙血的剑",
        "12303": "白铁大剑",
        "12304": "石英大剑",
        "12305": "以理服人",
        "12306": "飞天大御剑",
        "12401": "西风大剑",
        "12402": "钟剑",
        "12403": "祭礼大剑",
        "12404": "宗室大剑",
        "12405": "雨裁",
        "12406": "试作古华",
        "12407": "白影剑",
        "12408": "黑岩斩刀",
        "12409": "螭骨剑",
        "12410": "千岩古剑",
        "12411": "雪葬的星银",
        "12412": "衔珠海皇",
        "12414": "桂木斩长正",
        "12416": "恶王丸",
        "12501": "天空之傲",
        "12502": "狼的末路",
        "12503": "松籁响起之时",
        "12504": "无工之剑",
        "12510": "赤角石溃杵",
        "13101": "新手长枪",
        "13201": "铁尖枪",
        "13301": "白缨枪",
        "13302": "钺矛",
        "13303": "黑缨枪",
        "13304": "「旗杆」",
        "13401": "匣里灭辰",
        "13402": "试作星镰",
        "13403": "流月针",
        "13404": "黑岩刺枪",
        "13405": "决斗之枪",
        "13406": "千岩长枪",
        "13407": "西风长枪",
        "13408": "宗室猎枪",
        "13409": "龙脊长枪",
        "13414": "喜多院十文字",
        "13415": "「渔获」",
        "13416": "断浪长鳍",
        "13501": "护摩之杖",
        "13502": "天空之脊",
        "13504": "贯虹之槊",
        "13505": "和璞鸢",
        "13507": "息灾",
        "13509": "薙草之稻光",
        "14101": "学徒笔记",
        "14201": "口袋魔导书",
        "14301": "魔导绪论",
        "14302": "讨龙英杰谭",
        "14303": "异世界行记",
        "14304": "翡玉法球",
        "14305": "甲级宝珏",
        "14306": "琥珀玥",
        "14401": "西风秘典",
        "14402": "流浪乐章",
        "14403": "祭礼残章",
        "14404": "宗室秘法录",
        "14405": "匣里日月",
        "14406": "试作金珀",
        "14407": "万国诸海图谱",
        "14408": "黑岩绯玉",
        "14409": "昭心",
        "14410": "暗巷的酒与诗",
        "14412": "忍冬之果",
        "14413": "嘟嘟可故事集",
        "14414": "白辰之环",
        "14415": "证誓之明瞳",
        "14501": "天空之卷",
        "14502": "四风原典",
        "14504": "尘世之锁",
        "14506": "不灭月华",
        "14509": "神乐之真意",
        "15101": "猎弓",
        "15201": "历练的猎弓",
        "15301": "鸦羽弓",
        "15302": "神射手之誓",
        "15303": "反曲弓",
        "15304": "弹弓",
        "15305": "信使",
        "15306": "黑檀弓",
        "15401": "西风猎弓",
        "15402": "绝弦",
        "15403": "祭礼弓",
        "15404": "宗室长弓",
        "15405": "弓藏",
        "15406": "试作澹月",
        "15407": "钢轮弓",
        "15408": "黑岩战弓",
        "15409": "苍翠猎弓",
        "15410": "暗巷猎手",
        "15411": "落霞",
        "15412": "幽夜华尔兹",
        "15413": "风花之颂",
        "15414": "破魔之弓",
        "15415": "掠食者",
        "15416": "曚云之月",
        "15501": "天空之翼",
        "15502": "阿莫斯之弓",
        "15503": "终末嗟叹之诗",
        "15507": "冬极白星",
        "15508": "若水",
        "15509": "飞雷之弦振"
    }
    return nameTrans, weaponTrans


def getArtiTrans() -> Dict:
    global artiTrans
    artiTrans = {
        "10001": {
            "1": "故人之心",
            "2": "归乡之羽",
            "3": "逐光之石",
            "4": "异国之盏",
            "5": "感别之冠"
        },
        "10002": {
            "1": "勇士的勋章",
            "2": "勇士的期许",
            "3": "勇士的坚毅",
            "4": "勇士的壮行",
            "5": "勇士的冠冕"
        },
        "10003": {
            "1": "守护之花",
            "2": "守护徽印",
            "3": "守护座钟",
            "4": "守护之皿",
            "5": "守护束带"
        },
        "10004": {
            "1": "奇迹之花",
            "2": "奇迹之羽",
            "3": "奇迹之沙",
            "4": "奇迹之杯",
            "5": "奇迹耳坠"
        },
        "10005": {
            "1": "战狂的蔷薇",
            "2": "战狂的翎羽",
            "3": "战狂的时计",
            "4": "战狂的骨杯",
            "5": "战狂的鬼面"
        },
        "10006": {
            "1": "武人的红花",
            "2": "武人的羽饰",
            "3": "武人的水漏",
            "4": "武人的酒杯",
            "5": "武人的头巾"
        },
        "10007": {
            "1": "教官的胸花",
            "2": "教官的羽饰",
            "3": "教官的怀表",
            "4": "教官的茶杯",
            "5": "教官的帽子"
        },
        "10008": {
            "1": "赌徒的胸花",
            "2": "赌徒的羽饰",
            "3": "赌徒的怀表",
            "4": "赌徒的骰盅",
            "5": "赌徒的耳环"
        },
        "10009": {
            "1": "流放者之花",
            "2": "流放者之羽",
            "3": "流放者怀表",
            "4": "流放者之杯",
            "5": "流放者头冠"
        },
        "10010": {
            "1": "冒险家之花",
            "2": "冒险家尾羽",
            "3": "冒险家怀表",
            "4": "冒险家金杯",
            "5": "冒险家头带"
        },
        "10011": {
            "1": "幸运儿绿花",
            "2": "幸运儿鹰羽",
            "3": "幸运儿沙漏",
            "4": "幸运儿之杯",
            "5": "幸运儿银冠"
        },
        "10012": {
            "1": "学士的书签",
            "2": "学士的羽笔",
            "3": "学士的时钟",
            "4": "学士的墨杯",
            "5": "学士的镜片"
        },
        "10013": {
            "1": "游医的银莲",
            "2": "游医的枭羽",
            "3": "游医的怀钟",
            "4": "游医的药壶",
            "5": "游医的方巾"
        },
        "14001": {
            "1": "历经风雪的思念",
            "2": "摧冰而行的执望",
            "3": "冰雪故园的终期",
            "4": "遍结寒霜的傲骨",
            "5": "破冰踏雪的回音"
        },
        "14002": {
            "1": "平雷之心",
            "2": "平雷之羽",
            "3": "平雷之刻",
            "4": "平雷之器",
            "5": "平雷之冠"
        },
        "14003": {
            "1": "渡火者的决绝",
            "2": "渡火者的解脱",
            "3": "渡火者的煎熬",
            "4": "渡火者的醒悟",
            "5": "渡火者的智慧"
        },
        "14004": {
            "1": "远方的少女之心",
            "2": "少女飘摇的思念",
            "3": "少女苦短的良辰",
            "4": "少女片刻的闲暇",
            "5": "少女易逝的芳颜"
        },
        "15001": {
            "1": "角斗士的留恋",
            "2": "角斗士的归宿",
            "3": "角斗士的希冀",
            "4": "角斗士的酣醉",
            "5": "角斗士的凯旋"
        },
        "15002": {
            "1": "野花记忆的绿野",
            "2": "猎人青翠的箭羽",
            "3": "翠绿猎人的笃定",
            "4": "翠绿猎人的容器",
            "5": "翠绿的猎人之冠"
        },
        "15003": {
            "1": "乐团的晨光",
            "2": "琴师的箭羽",
            "3": "终幕的时计",
            "4": "吟游者之壶",
            "5": "指挥的礼帽"
        },
        "15004": {
            "1": "凛冬霜心",
            "2": "雪藏之羽",
            "3": "凝冰成砂",
            "4": "北风之盏",
            "5": "冰河之冠"
        },
        "15005": {
            "1": "雷鸟的怜悯",
            "2": "雷灾的孑遗",
            "3": "雷霆的时计",
            "4": "降雷的凶兆",
            "5": "唤雷的头冠"
        },
        "15006": {
            "1": "魔女的炎之花",
            "2": "魔女常燃之羽",
            "3": "魔女破灭之时",
            "4": "魔女的心之火",
            "5": "焦灼的魔女帽"
        },
        "15007": {
            "1": "宗室之花",
            "2": "宗室之翎",
            "3": "宗室时计",
            "4": "宗室银瓮",
            "5": "宗室面具"
        },
        "15008": {
            "1": "染血的铁之心",
            "2": "染血的黑之羽",
            "3": "骑士染血之时",
            "4": "染血骑士之杯",
            "5": "染血的铁假面"
        },
        "15009": {
            "5": "祭火礼冠"
        },
        "15010": {
            "5": "祭水礼冠"
        },
        "15011": {
            "5": "祭雷礼冠"
        },
        "15012": {
            "5": "祭风礼冠"
        },
        "15013": {
            "5": "祭冰礼冠"
        },
        "15014": {
            "1": "磐陀裂生之花",
            "2": "嵯峨群峰之翼",
            "3": "星罗圭璧之晷",
            "4": "巉岩琢塑之樽",
            "5": "不动玄石之相"
        },
        "15015": {
            "1": "夏祭之花",
            "2": "夏祭终末",
            "3": "夏祭之刻",
            "4": "夏祭水玉",
            "5": "夏祭之面"
        },
        "15016": {
            "1": "饰金胸花",
            "2": "追忆之风",
            "3": "坚铜罗盘",
            "4": "沉波之盏",
            "5": "酒渍船帽"
        },
        "15017": {
            "1": "勋绩之花",
            "2": "昭武翎羽",
            "3": "金铜时晷",
            "4": "盟誓金爵",
            "5": "将帅兜鍪"
        },
        "15018": {
            "1": "无垢之花",
            "2": "贤医之羽",
            "3": "停摆之刻",
            "4": "超越之盏",
            "5": "嗤笑之面"
        },
        "15019": {
            "1": "羁缠之花",
            "2": "思忆之矢",
            "3": "朝露之时",
            "4": "祈望之心",
            "5": "无常之面"
        },
        "15020": {
            "1": "明威之镡",
            "2": "切落之羽",
            "3": "雷云之笼",
            "4": "绯花之壶",
            "5": "华饰之兜"
        },
        "15021": {
            "1": "荣花之期",
            "2": "华馆之羽",
            "3": "众生之谣",
            "4": "梦醒之瓢",
            "5": "形骸之笠"
        },
        "15022": {
            "1": "海染之花",
            "2": "渊宫之羽",
            "3": "离别之贝",
            "4": "真珠之笼",
            "5": "海祇之冠"
        },
        "15023": {
            "1": "生灵之华",
            "2": "潜光片羽",
            "3": "阳辔之遗",
            "4": "结契之刻",
            "5": "虺雷之姿"
        },
        "15024": {
            "1": "魂香之花",
            "2": "垂玉之叶",
            "3": "祝祀之凭",
            "4": "涌泉之盏",
            "5": "浮溯之珏"
        }
    }
    return artiTrans


def getEnkaTrans() -> Tuple[Dict, Dict, Dict]:
    global propTrans
    global posTrans
    global eTypeTrans
    propTrans = {
        "FIGHT_PROP_PHYSICAL_ADD_HURT": "物理伤害加成",
        "FIGHT_PROP_FIRE_ADD_HURT": "火元素伤害加成",
        "FIGHT_PROP_ELEC_ADD_HURT": "雷元素伤害加成",
        "FIGHT_PROP_WATER_ADD_HURT": "水元素伤害加成",
        "FIGHT_PROP_WIND_ADD_HURT": "风元素伤害加成",
        "FIGHT_PROP_ROCK_ADD_HURT": "岩元素伤害加成",
        "FIGHT_PROP_ICE_ADD_HURT": "冰元素伤害加成",
        "FIGHT_PROP_HP": "生命值",
        "FIGHT_PROP_HP_PERCENT": "生命值百分比",
        "FIGHT_PROP_ATTACK": "攻击力",
        "FIGHT_PROP_ATTACK_PERCENT": "攻击力百分比",
        "FIGHT_PROP_DEFENSE": "防御力",
        "FIGHT_PROP_DEFENSE_PERCENT": "防御力百分比",
        "FIGHT_PROP_CRITICAL": "暴击率",
        "FIGHT_PROP_CRITICAL_HURT": "暴击伤害",
        "FIGHT_PROP_ELEMENT_MASTERY": "元素精通",
        "FIGHT_PROP_CHARGE_EFFICIENCY": "元素充能效率",
        "FIGHT_PROP_HEAL_ADD": "治疗加成",
        "FIGHT_PROP_BASE_ATTACK": "武器基础攻击力"
    }
    posTrans = {
        "EQUIP_BRACER": 1,
        "EQUIP_NECKLACE": 2,
        "EQUIP_SHOES": 3,
        "EQUIP_RING": 4,
        "EQUIP_DRESS": 5
    }
    eTypeTrans = {
        "ITEM_RELIQUARY": "圣遗物",
        "ITEM_WEAPON": "武器"
    }
    return propTrans, posTrans, eTypeTrans


def getCalcData() -> Tuple[Dict, Dict, List, Dict]:
    global attrValue
    global allMainAffix
    global allSubAffix
    global multiRule
    attrValue = {
        "生命值": 5.83,
        "攻击力": 5.83,
        "防御力": 7.29,
        "暴击率": 3.89,
        "暴击伤害": 7.77,
        "元素伤害加成": 5.825,
        "物理伤害加成": 7.288,
        "元素精通": 23.31,
        "元素充能效率": 6.48,
        "治疗加成": 4.487
    }
    allMainAffix = {
        "3": [
            "攻击力",
            "防御力",
            "生命值",
            "元素精通",
            "元素充能效率"
        ],
        "4": [
            "攻击力",
            "防御力",
            "生命值",
            "元素精通",
            "元素伤害加成",
            "物理伤害加成"
        ],
        "5": [
            "攻击力",
            "防御力",
            "生命值",
            "元素精通",
            "元素充能效率",
            "治疗加成",
            "暴击伤害",
            "暴击率"
        ]
    }
    allSubAffix = [
        "攻击力",
        "防御力",
        "生命值",
        "元素精通",
        "元素充能效率",
        "暴击率",
        "暴击伤害"
    ]
    multiRule = {
        "钟离": ["钟离", "钟离-血牛"],
        "甘雨": ["甘雨", "甘雨-永冻"],
        "芭芭拉": ["芭芭拉", "芭芭拉-暴力"]
    }
    return attrValue, allMainAffix, allSubAffix, multiRule
